# Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# Importing Data

In [2]:
# Creating a path
path = r'C:\Users\duongxma\Dropbox\CareerFoundry - Data Analytics\Data Immersion\Achievement 4\Instacart Basket Analysis'

In [3]:
# Importing products.csv file
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# [Step 1]

In [4]:
# Import orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# [Step 2]

In [5]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [6]:
# I'm not sure what the Unnamed: 0 column is supposed to be, so that would need to be investigated and relabeled, or dropped.  
# It's not so much an error, but I am surprised the max days_since_last_order is 30, and not higher. I guess people ordering
# groceries on a monthly basis isn't abnormal, but I'm surprised there isn't more of an outlier like someone trying it out once
# and deciding it wasn't for them, so their last order would be over a year ago or something.

In [17]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [ ]:
# The 99999.000000 for the max in the prices column is interesting because I don't think something on Instacart would cost $99K,
# or would someone order that much of groceries. It looks like a default placeholder when a number is just too big like damage
# in a video game, so it just shows a bunch of 9s. This record (or these records) should be reviewed and edited to show the 
# actual prices paid because such a large number not only skews our calculations, but it's clearly not a real figure either;
# it's as useful as a blank entry. The $1 min makes me wonder if taxes were taken into consideration because how many things are
# exactly a dollar? It may well be the correct price, but a nuance to mention when presenting the data that taxes are or aren't
# included, or if it's a rounded figure.

# Mixed-Type Data

In [7]:
# Create a dataframe

df_test = pd.DataFrame()

In [8]:
# Create a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [9]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [10]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [11]:
# Changing data type to string

df_test['mix'] = df_test['mix'].astype('str')

# [Step 3]

In [14]:
# Check for mixed-type data in your df_ords dataframe.

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

Unnamed: 0  consistent
order_id  consistent
user_id  consistent
eval_set  consistent
order_number  consistent
order_day_of_week  consistent
order_hour_of_day  consistent
days_since_last_order  consistent

In [16]:
# Check for mixed-type data in your df_prods dataframe

for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].applymap(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

product_id  consistent
product_name  mixed
aisle_id  consistent
department_id  consistent
prices  consistent

# [Step 4]

In [35]:
df_ords.dtypes

Unnamed: 0                 int64
order_id                   int64
user_id                    int64
eval_set                  object
order_number               int64
order_day_of_week          int64
order_hour_of_day          int64
days_since_last_order    float64
dtype: object

In [ ]:
# There are no mixed data types in this df, so nothing to fix.

In [15]:
df_prods.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [ ]:
# product_name has mixed types, but since it's a name, which can contain both letters and numbers, it's probably best to leave
# it alone after we review a few of the entries.

# Missing Values

In [16]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [17]:
# Create a new dataframe that's only selecting null values in the product_name column

df_nan = df_prods[df_prods["product_name"].isnull() == True]

In [18]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [21]:
df_prods.median()

C:\Users\duongxma\AppData\Local\Temp\1\ipykernel_13840\3387230063.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_prods.median()

product_id       24845.0
aisle_id            69.0
department_id       13.0
prices               7.1
dtype: float64

In [22]:
# Check the number of rows and columns in the dataframe

df_prods.shape

(49693, 5)

In [23]:
# Create new dataframe where the product_name column isn't null

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [24]:
# Check the number of rows and columns in the new dataframe

df_prods_clean.shape

(49677, 5)

In [25]:
df_prods.dropna(inplace = True)

In [27]:
df_prods.dropna(subset = ['product_name'], inplace = True)

# [Step 5]

In [36]:
# Check for null values in df_ords

df_ords.isnull().sum()

Unnamed: 0                    0
order_id                      0
user_id                       0
eval_set                      0
order_number                  0
order_day_of_week             0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [37]:
# Drop the Unnamed: 0 column from the dataframe

df_ords = df_ords.drop(columns = ['Unnamed: 0'])

In [39]:
# Create subset for the null values for the days_since_last_order in df_ords

df_ords_nan = df_ords[df_ords['days_since_last_order'].isnull() == True]

In [40]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [41]:
# Check to see if there's a relationship between the order_number and days_since_last_order for user_id = 1

df_ords[df_ords['user_id'] == 1]

,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0
6,550135,1,prior,7,1,9,20.0
7,3108588,1,prior,8,1,14,14.0
8,2295261,1,prior,9,1,16,0.0
9,2550362,1,prior,10,4,8,30.0
10,1187899,1,train,11,4,8,14.0

In [42]:
# Check to see if there's a relationship between the order_number and days_since_last_order for user_id = 2

df_ords[df_ords['user_id'] == 2]

,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
11,2168274,2,prior,1,2,11,NaN
12,1501582,2,prior,2,5,10,10.0
13,1901567,2,prior,3,1,10,3.0
14,738281,2,prior,4,2,10,8.0
15,1673511,2,prior,5,3,11,8.0
16,1199898,2,prior,6,2,9,13.0
17,3194192,2,prior,7,2,12,14.0
18,788338,2,prior,8,1,15,27.0
19,1718559,2,prior,9,2,9,8.0
20,1447487,2,prior,10,1,11,6.0
21,1402090,2,prior,11,1,10,30.0
22,3186735,2,prior,12,1,9,28.0
23,3268552,2,prior,13,4,11,30.0
24,839880,2,prior,14,3,10,13.0
25,1492625,2,train,15,1,11,30.0

In [43]:
df_ords[df_ords['order_number'] == 1]

,order_id,user_id,eval_set,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

In [ ]:
# It was curious to me that the null values matched the number of null values (206209) matched the number of rows in df_ords.
# I was wondering if there was a relationship between the order_number and the days_since_last_order column, and there was.
# In the above two user samples, the entry with a null value is their first order, so there wouldn't be a "last order" since
# it's their first order. I tested it again using the order_number column as my "filter" and by setting it to 1 (first order),
# the same pattern emerges, which makes sense intuitively that there isn't a "last order" before the very first order.

# [Step 6]

In [ ]:
# I don't think there needs to be any changes to the data because it's reflective of reality; there shouldn't be a last order
# date before the very first purchase.

# Duplicates

In [28]:
# Create new dataframe that contains only rows that are duplicate

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [29]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [30]:
df_prods_clean.shape

(49677, 5)

In [31]:
# Create new dataframe that doesn't contain rows with duplicates

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [32]:
df_prods_clean_no_dups.shape

(49672, 5)

# [Step 7]

In [44]:
# Check for duplicates in df_ords

df_ords_dups = df_ords[df_ords.duplicated()]

In [45]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, eval_set, order_number, order_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

In [46]:
df_ords_dups.shape

(0, 7)

In [47]:
# There are no duplicates in df_ords. This is great, and unless there's a glitch in the system, duplicates should be rare. 
# Even if someone purchases the same thing, on the same day, at the same time, the order_number and days_since_last order
# should always be counting upwards, so there shouldn't be any true duplicates in this data set.

# [Step 8]

In [ ]:
# There are thankfully no duplicates in this df. If there were duplicates, I'd imagine we'd have to investigate further to see
# if there was a system glitch or an accidental override, then write a new script to fix it.

# Exporting the Data [Step 9]

In [48]:
# Export df_prods_clean_no_dups

df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

In [49]:
# Export final df_ords 

df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))